zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc01/atdf/PIC32CK1012GC01064.atdf
        <module name="TPIU" id="SYSTEM_IP" version="1.0.0">
          <instance name="TPIU">
            <register-group name="TPIU" name-in-module="TPIU" address-space="base" offset="0xE0040000"/>
          </instance>
        </module>
        <module name="TRAM" id="03938" name2="drm_tram_u2801_v2" version="2a0">
          <instance name="TRAM">
            <register-group name="TRAM" name-in-module="TRAM" address-space="base" offset="0x4401E000"/>
            <parameters>
              <param name="ADDR_MSB" value="7" caption="Value of the MSB bit of physical RAM address"/>
              <param name="INSTANCE_ID" value="15" caption="Instance index for TRAM"/>
              <param name="MCLK_ID_APB" value="47" caption="Index for TRAM APB clock"/>
              <param name="PAC_ID" value="15" caption="Index for TRAM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="03597" name2="math_trng_u2242_v1" version="1d0">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x45024000"/>
            <parameters>
              <param name="INSTANCE_ID" value="82" caption="Instance index for TRNG"/>
              <param name="MCLK_ID_APB" value="112" caption="Index for TRNG APB clock"/>
              <param name="PAC_ID" value="82" caption="Index for TRNG registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="USB" id="03613" name2="usb_u2222_v1" version="1d0">
          <instance name="USB">
            <register-group name="USB" name-in-module="USB" address-space="base" offset="0x4502A000"/>
            <signals>
              <signal group="DM" function="H" pad="PD03" ioset="1"/>
              <signal group="DP" function="H" pad="PD04" ioset="1"/>
              <signal group="SOF_1KHZ" function="H" pad="PC01" ioset="2"/>
              <signal group="SOF_1KHZ" function="H" pad="PD02" ioset="1"/>
            </signals>
            <parameters>
              <param name="AHB_2_USB_FIFO_DEPTH" value="4" caption="bytes number, should be at least 2, and 2^n (4,8,16 ...)"/>
              <param name="AHB_2_USB_RD_DATA_BITS" value="8" caption="8, 16 or 32, here : 8-bits is required as UTMI interface should work in 8-bits mode"/>
              <param name="AHB_2_USB_WR_DATA_BITS" value="32" caption="8, 16 or 32 : here, AHB transfer is made in word mode"/>
              <param name="AHB_2_USB_WR_THRESHOLD" value="2" caption="as soon as there are N bytes-free inside the fifo, ahb read transfer is requested"/>
              <param name="DATA_BUS_16_8" value="0" caption="UTMI/SIE data bus size : 0 -&gt; 8 bits, 1 -&gt; 16 bits"/>
              <param name="EPNUM" value="8" caption="parameter for rtl : max of ENDPOINT and PIPE NUM"/>
              <param name="EPT_NUM" value="8" caption="Number of USB end points"/>
              <param name="GCLK_ID" value="46" caption="Index of Generic Clock"/>
              <param name="INITIAL_CONTROL_QOS" value="3" caption="CONTROL QOS RESET value"/>
              <param name="INITIAL_DATA_QOS" value="3" caption="DATA QOS RESET value"/>
              <param name="MISSING_SOF_DET_IMPLEMENTED" value="1" caption="48 mHz xPLL feature implemented"/>
              <param name="PIPE_NUM" value="8" caption="Number of USB pipes"/>
              <param name="SYSTEM_CLOCK_IS_CKUSB" value="0" caption="Dual (1'b0) or Single (1'b1) clock system"/>
              <param name="USB_2_AHB_FIFO_DEPTH" value="4" caption="bytes number, should be at least 2, and 2^n (4,8,16 ...)"/>
              <param name="USB_2_AHB_RD_DATA_BITS" value="16" caption="8, 16 or 32, here : 8-bits is required as UTMI interface should work in 8-bits mode"/>
              <param name="USB_2_AHB_RD_THRESHOLD" value="2" caption="as soon as there are 16 bytes-free inside the fifo, ahb read transfer is requested"/>
              <param name="USB_2_AHB_WR_DATA_BITS" value="8" caption="8, 16 or 32 : here : 8-bits is required as UTMI interface should work in 8-bits mode"/>
              <param name="INSTANCE_ID" value="85" caption="Instance index for USB"/>
              <param name="MCLK_ID_AHB" value="19" caption="Index for USB AHB clock"/>
              <param name="MCLK_ID_APB" value="113" caption="Index for USB APB clock"/>
              <param name="PAC_ID" value="85" caption="Index for USB registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="03611" name2="wdt_u2251_v2" version="2b0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x44016000"/>
            <parameters>
              <param name="FUSES_UPDATE_SUPPORT" value="0" caption="WDT Fuse Update Support"/>
              <param name="INSTANCE_ID" value="11" caption="Instance index for WDT"/>
              <param name="MCLK_ID_APB" value="43" caption="Index for WDT APB clock"/>
              <param name="PAC_ID" value="11" caption="Index for WDT registers write protection"/>
            </parameters>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault"/>
        <interrupt name="MemoryManagement" index="-12" caption="Memory Management, MPU mismatch, including Access Violation and No Match"/>
        <interrupt name="BusFault" index="-11" caption="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault"/>
        <interrupt name="UsageFault" index="-10" caption="Usage Fault, i.e. Undef Instruction, Illegal State Transition"/>
        <interrupt name="SecureFaultMonitor" index="-9" caption="Secure Fault"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction"/>
        <interrupt name="DebugMonitor" index="-4" caption="Debug Monitor"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="FCR_ERR" index="0" module-instance="FCR" caption="Flash Read Controller ECC Error"/>
        <interrupt name="FCR_FLT" index="1" module-instance="FCR" caption="Flash Read Controller CRC Fault"/>
        <interrupt name="FCW" index="2" module-instance="FCW" caption="Flash Write Controller Interrupt"/>
        <interrupt name="PM" index="3" module-instance="PM" caption="Power Manager"/>
        <interrupt name="SUPC" index="4" module-instance="SUPC" caption="Supply Controller"/>
        <interrupt name="OSCCTRL_XOSC" index="5" module-instance="OSCCTRL" caption="External Oscillator"/>
        <interrupt name="OSCCTRL_DFLL" index="6" module-instance="OSCCTRL" caption="DFLL"/>
        <interrupt name="OSCCTRL_PLL0" index="7" module-instance="OSCCTRL" caption="PLL"/>
        <interrupt name="OSC32KCTRL" index="8" module-instance="OSC32KCTRL" caption="32K Oscillator"/>
        <interrupt name="MCLK" index="9" module-instance="MCLK" caption="Main Clock"/>
        <interrupt name="FREQM" index="10" module-instance="FREQM" caption="Frequency Meter"/>
        <interrupt name="WDT" index="11" module-instance="WDT" caption="Watchdog Timer"/>
        <interrupt name="RTC" index="12" module-instance="RTC" caption="RTC"/>
        <interrupt name="EIC_EXTINT_0" index="13" module-instance="EIC" caption="External Interrupt 0"/>
        <interrupt name="EIC_EXTINT_1" index="14" module-instance="EIC" caption="External Interrupt 1"/>
        <interrupt name="EIC_EXTINT_2" index="15" module-instance="EIC" caption="External Interrupt 2"/>
        <interrupt name="EIC_EXTINT_3" index="16" module-instance="EIC" caption="External Interrupt 3"/>
        <interrupt name="EIC_EXTINT_4" index="17" module-instance="EIC" caption="External Interrupt 4"/>
        <interrupt name="EIC_EXTINT_5" index="18" module-instance="EIC" caption="External Interrupt 5"/>
        <interrupt name="EIC_EXTINT_6" index="19" module-instance="EIC" caption="External Interrupt 6"/>
        <interrupt name="EIC_EXTINT_7" index="20" module-instance="EIC" caption="External Interrupt 7"/>
        <interrupt name="EIC_EXTINT_8" index="21" module-instance="EIC" caption="External Interrupt 8"/>
        <interrupt name="EIC_EXTINT_9" index="22" module-instance="EIC" caption="External Interrupt 9"/>
        <interrupt name="EIC_EXTINT_10" index="23" module-instance="EIC" caption="External Interrupt 10"/>
        <interrupt name="EIC_EXTINT_11" index="24" module-instance="EIC" caption="External Interrupt 11"/>
        <interrupt name="EIC_EXTINT_12" index="25" module-instance="EIC" caption="External Interrupt 12"/>
        <interrupt name="EIC_EXTINT_13" index="26" module-instance="EIC" caption="External Interrupt 13"/>
        <interrupt name="EIC_EXTINT_14" index="27" module-instance="EIC" caption="External Interrupt 14"/>
        <interrupt name="EIC_EXTINT_15" index="28" module-instance="EIC" caption="External Interrupt 15"/>
        <interrupt name="EIC_NSCHK" index="29" module-instance="EIC" caption="External Interrupt Non-Secure Check"/>
        <interrupt name="PAC" index="30" module-instance="PAC" caption="Peripheral Access Controller"/>
        <interrupt name="TRAM" index="31" module-instance="TRAM" caption="Trust RAM Interrupt"/>
        <interrupt name="PORT" index="32" module-instance="PORT" caption="Port"/>
        <interrupt name="DMA0_PRI0" index="33" module-instance="DMA0" caption="DMA 0 Priority 0 Interrupt"/>
        <interrupt name="DMA0_PRI1" index="34" module-instance="DMA0" caption="DMA 0 Priority 1 Interrupt"/>
        <interrupt name="DMA0_PRI2" index="35" module-instance="DMA0" caption="DMA 0 Priority 2 Interrupt"/>
        <interrupt name="DMA1_PRI0" index="36" module-instance="DMA1" caption="DMA 1 Priority 0 Interrupt"/>
        <interrupt name="DMA1_PRI1" index="37" module-instance="DMA1" caption="DMA 1 Priority 1 Interrupt"/>
        <interrupt name="HMATRIX" index="38" module-instance="HMATRIX" caption="HMATRIX"/>
        <interrupt name="EVSYS_0" index="39" module-instance="EVSYS" caption="Event System Channel 0"/>
        <interrupt name="EVSYS_1" index="40" module-instance="EVSYS" caption="Event System Channel 1"/>
        <interrupt name="EVSYS_2" index="41" module-instance="EVSYS" caption="Event System Channel 2"/>
        <interrupt name="EVSYS_3" index="42" module-instance="EVSYS" caption="Event System Channel 3"/>
        <interrupt name="EVSYS_OTHER" index="43" module-instance="EVSYS" caption="Event System Channel 4..X"/>
        <interrupt name="SERCOM0_56" index="44" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_0" index="45" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_1" index="46" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_2" index="47" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_3" index="48" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM0_4" index="49" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM1_56" index="50" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_0" index="51" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_1" index="52" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_2" index="53" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_3" index="54" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM1_4" index="55" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM2_56" index="56" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_0" index="57" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_1" index="58" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_2" index="59" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_3" index="60" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM2_4" index="61" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM3_56" index="62" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM3_0" index="63" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM3_1" index="64" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM3_2" index="65" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM3_3" index="66" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM3_4" index="67" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="TCC0_OTHER" index="68" module-instance="TCC0" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC0_MC0" index="69" module-instance="TCC0" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC0_MC1" index="70" module-instance="TCC0" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC0_MC2" index="71" module-instance="TCC0" caption="TCC Match/Compare 2"/>
        <interrupt name="TCC0_MC3" index="72" module-instance="TCC0" caption="TCC Match/Compare 3"/>
        <interrupt name="TCC0_MC4" index="73" module-instance="TCC0" caption="TCC Match/Compare 4"/>
        <interrupt name="TCC0_MC5" index="74" module-instance="TCC0" caption="TCC Match/Compare 5"/>
        <interrupt name="TCC1_OTHER" index="75" module-instance="TCC1" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC1_MC0" index="76" module-instance="TCC1" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC1_MC1" index="77" module-instance="TCC1" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC1_MC2" index="78" module-instance="TCC1" caption="TCC Match/Compare 2"/>
        <interrupt name="TCC1_MC3" index="79" module-instance="TCC1" caption="TCC Match/Compare 3"/>
        <interrupt name="TCC1_MC4" index="80" module-instance="TCC1" caption="TCC Match/Compare 4"/>
        <interrupt name="TCC1_MC5" index="81" module-instance="TCC1" caption="TCC Match/Compare 5"/>
        <interrupt name="TCC2_OTHER" index="82" module-instance="TCC2" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC2_MC0" index="83" module-instance="TCC2" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC2_MC1" index="84" module-instance="TCC2" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC2_MC2" index="85" module-instance="TCC2" caption="TCC Match/Compare 2"/>
        <interrupt name="TCC2_MC3" index="86" module-instance="TCC2" caption="TCC Match/Compare 3"/>
        <interrupt name="TCC2_MC4" index="87" module-instance="TCC2" caption="TCC Match/Compare 4"/>
        <interrupt name="TCC2_MC5" index="88" module-instance="TCC2" caption="TCC Match/Compare 5"/>
        <interrupt name="TCC3_OTHER" index="89" module-instance="TCC3" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC3_MC0" index="90" module-instance="TCC3" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC3_MC1" index="91" module-instance="TCC3" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC3_MC2" index="92" module-instance="TCC3" caption="TCC Match/Compare 2"/>
        <interrupt name="TCC3_MC3" index="93" module-instance="TCC3" caption="TCC Match/Compare 3"/>
        <interrupt name="TCC3_MC4" index="94" module-instance="TCC3" caption="TCC Match/Compare 4"/>
        <interrupt name="TCC3_MC5" index="95" module-instance="TCC3" caption="TCC Match/Compare 5"/>
        <interrupt name="SERCOM4_56" index="96" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM4_0" index="97" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM4_1" index="98" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM4_2" index="99" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM4_3" index="100" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM4_4" index="101" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM5_56" index="102" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM5_0" index="103" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM5_1" index="104" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM5_2" index="105" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM5_3" index="106" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="SERCOM5_4" index="107" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="TCC4_OTHER" index="120" module-instance="TCC4" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC4_MC0" index="121" module-instance="TCC4" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC4_MC1" index="122" module-instance="TCC4" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC5_OTHER" index="123" module-instance="TCC5" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC5_MC0" index="124" module-instance="TCC5" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC5_MC1" index="125" module-instance="TCC5" caption="TCC Match/Compare 1"/>
        <interrupt name="ADC_GLOBAL" index="132" module-instance="ADC" caption="ADC Global Interrupt"/>
        <interrupt name="ADC_CORE1" index="133" module-instance="ADC" caption="ADC Core 1 Interrupt"/>
        <interrupt name="Reserved2" index="134" module-instance="ADC" caption="ADC Unused/Reserved"/>
        <interrupt name="Reserved3" index="135" module-instance="ADC" caption="ADC Unused/Reserved"/>
        <interrupt name="Reserved4" index="136" module-instance="ADC" caption="ADC Unused/Reserved"/>
        <interrupt name="Reserved5" index="137" module-instance="ADC" caption="ADC Unused/Reserved"/>
        <interrupt name="AC" index="138" module-instance="AC" caption="Analog Comparator Interrupt"/>
        <interrupt name="PTC" index="139" module-instance="PTC" caption="Peripheral Touch Controller"/>
        <interrupt name="SPI_IXS" index="140" module-instance="SPI_IXS" caption="Audio SPI Interrupt"/>
        <interrupt name="PCC" index="141" module-instance="PCC" caption="PCC"/>
        <interrupt name="PDEC" index="142" module-instance="PDEC" caption="PDEC"/>
        <interrupt name="CAN0" index="143" module-instance="CAN0" caption="Controller Area Network 0"/>
        <interrupt name="ETH" index="145" module-instance="ETH" caption="Ethernet MAC Interrupt"/>
        <interrupt name="SQI" index="146" module-instance="SQI" caption="Quad SPI Interrupt"/>
        <interrupt name="TRNG" index="147" module-instance="TRNG" caption="True Random Generator"/>
        <interrupt name="SDMMC0" index="148" module-instance="SDMMC0" caption="SD/MMC Host Controller Interrupt 0"/>
        <interrupt name="USB_OTHER" index="150" module-instance="USB" caption="USB Other Interrupt"/>
        <interrupt name="USB_SOF" index="151" module-instance="USB" caption="USB SOF Interrupt"/>
        <interrupt name="USB_TRCPT0" index="152" module-instance="USB" caption="USB TRCPT0 Interrupt"/>
        <interrupt name="USB_TRCPT1" index="153" module-instance="USB" caption="USB TRCPT1 Interrupt"/>
        <interrupt name="FLEXRAM" index="158" module-instance="FLEXRAM"/>
      </interrupts>
      <events>
        <generators>
          <generator name="SUPC_LVDET" index="1" module-instance="SUPC"/>
          <generator name="OSCCTRL_XOSC_FAIL" index="2" module-instance="OSCCTRL"/>
          <generator name="OSC32KCTRL_XOSC32K_FAIL" index="3" module-instance="OSC32KCTRL"/>
          <generator name="FREQM_DONE" index="4" module-instance="FREQM"/>
          <generator name="FREQM_WINMON" index="5" module-instance="FREQM"/>
          <generator name="RTC_PER_0" index="6" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="8" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="9" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="10" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="11" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="12" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="13" module-instance="RTC"/>
          <generator name="RTC_PERD" index="14" module-instance="RTC"/>
          <generator name="RTC_CMP_0" index="15" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="16" module-instance="RTC"/>
          <generator name="RTC_CMP_2" index="17" module-instance="RTC"/>
          <generator name="RTC_CMP_3" index="18" module-instance="RTC"/>
          <generator name="RTC_TAMPER" index="19" module-instance="RTC"/>
          <generator name="RTC_OVF" index="20" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="21" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="22" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="23" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="24" module-instance="EIC"/>
          <generator name="EIC_EXTINT_4" index="25" module-instance="EIC"/>
          <generator name="EIC_EXTINT_5" index="26" module-instance="EIC"/>
          <generator name="EIC_EXTINT_6" index="27" module-instance="EIC"/>
          <generator name="EIC_EXTINT_7" index="28" module-instance="EIC"/>
          <generator name="EIC_EXTINT_8" index="29" module-instance="EIC"/>
          <generator name="EIC_EXTINT_9" index="30" module-instance="EIC"/>
          <generator name="EIC_EXTINT_10" index="31" module-instance="EIC"/>
          <generator name="EIC_EXTINT_11" index="32" module-instance="EIC"/>
          <generator name="EIC_EXTINT_12" index="33" module-instance="EIC"/>
          <generator name="EIC_EXTINT_13" index="34" module-instance="EIC"/>
          <generator name="EIC_EXTINT_14" index="35" module-instance="EIC"/>
          <generator name="EIC_EXTINT_15" index="36" module-instance="EIC"/>
          <generator name="PAC_ACCERR" index="37" module-instance="PAC"/>
          <generator name="DMA0_CH_0" index="38" module-instance="DMA0"/>
          <generator name="DMA0_CH_1" index="39" module-instance="DMA0"/>
          <generator name="DMA0_CH_2" index="40" module-instance="DMA0"/>
          <generator name="DMA0_CH_3" index="41" module-instance="DMA0"/>
