zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc01/atdf/PIC32CK1012GC01064.atdf
        <register name="CHNCFG3" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Channel Configuration3 (SIGN/DIFF)">
          <bitfield name="DIFF" caption="Differential Mode" mask="0xFFFF"/>
          <bitfield name="SIGN" caption="SIGN setting" mask="0xFFFF0000"/>
        </register>
        <register name="CHNCFG4" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Channel Configuration 4 (TRGSRC)">
          <bitfield name="TRGSRC0" caption="Channel 0 Trigger Source" mask="0xF" values="CHNCFG4_CHNCFG5__TRGSRC"/>
          <bitfield name="TRGSRC1" caption="Channel 1 Trigger Source" mask="0xF0" values="CHNCFG4_CHNCFG5__TRGSRC"/>
          <bitfield name="TRGSRC2" caption="Channel 2 Trigger Source" mask="0xF00" values="CHNCFG4_CHNCFG5__TRGSRC"/>
          <bitfield name="TRGSRC3" caption="Channel 3 Trigger Source" mask="0xF000" values="CHNCFG4_CHNCFG5__TRGSRC"/>
          <bitfield name="TRGSRC4" caption="Channel 4 Trigger Source" mask="0xF0000" values="CHNCFG4_CHNCFG5__TRGSRC"/>
          <bitfield name="TRGSRC5" caption="Channel 5 Trigger Source" mask="0xF00000" values="CHNCFG4_CHNCFG5__TRGSRC"/>
          <bitfield name="TRGSRC6" caption="Channel 6 Trigger Source" mask="0xF000000" values="CHNCFG4_CHNCFG5__TRGSRC"/>
          <bitfield name="TRGSRC7" caption="Channel 7 Trigger Source" mask="0xF0000000" values="CHNCFG4_CHNCFG5__TRGSRC"/>
        </register>
        <register name="CHNCFG5" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Channel Configuration 5 (TRGSRC)">
          <bitfield name="TRGSRC8" caption="Channel 8 Trigger Source" mask="0xF" values="CHNCFG4_CHNCFG5__TRGSRC"/>
          <bitfield name="TRGSRC9" caption="Channel 9 Trigger Source" mask="0xF0" values="CHNCFG4_CHNCFG5__TRGSRC"/>
          <bitfield name="TRGSRC10" caption="Channel 10 Trigger Source" mask="0xF00" values="CHNCFG4_CHNCFG5__TRGSRC"/>
          <bitfield name="TRGSRC11" caption="Channel 11 Trigger Source" mask="0xF000" values="CHNCFG4_CHNCFG5__TRGSRC"/>
          <bitfield name="TRGSRC12" caption="Channel 12 Trigger Source" mask="0xF0000" values="CHNCFG4_CHNCFG5__TRGSRC"/>
          <bitfield name="TRGSRC13" caption="Channel 13 Trigger Source" mask="0xF00000" values="CHNCFG4_CHNCFG5__TRGSRC"/>
          <bitfield name="TRGSRC14" caption="Channel 14 Trigger Source" mask="0xF000000" values="CHNCFG4_CHNCFG5__TRGSRC"/>
          <bitfield name="TRGSRC15" caption="Channel 15 Trigger Source" mask="0xF0000000" values="CHNCFG4_CHNCFG5__TRGSRC"/>
        </register>
        <register name="CALCTRL" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="SARCORE Calibration Value">
          <mode name="DEFAULT"/>
          <mode name="FUSES_ADC_SARCORE_12BIT_V7A0"/>
          <mode name="FUSES_ADC_SARCORE_12BIT_V7C0"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="en_cmbf" caption="Enable Common Mode Buffer" mask="0x1"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="en_dither" caption="Enable Dither" mask="0x4"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="dis_faz" caption="Disable auto-zeroing" mask="0x8"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="dis_saz" caption="Disable auto-zeroing" mask="0x10"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="dis_laz" caption="Disable auto-zeroing" mask="0x20"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="en_rdac" caption="Disable Power Cycling" mask="0x40"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="dbg_sel" caption="Debug Bus Select" mask="0x80"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="sel_del" caption="Scan Mode comp_out" mask="0x100"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="t1_dly" caption="Regen Latch Delay" mask="0x600"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="tclk_div" caption="Test Clock Divider" mask="0xF800"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="iadc_1" caption="Current Consumption 1" mask="0x300000"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="iadc_2" caption="Current Consumption 2" mask="0xC00000"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="icmp_1" caption="Bias Current Stage 1" mask="0x3000000"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="icmp_2" caption="Bias Current Stage 2" mask="0xC000000"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="icmbf" caption="Bias Current Common Mode Buffer" mask="0x30000000"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="en_ext_bias" caption="Dsiable Internal Bias Circuit" mask="0x80000000"/>
          <bitfield modes="DEFAULT" name="CALBITS" caption="Calibration Values" mask="0xFFFFFFFF"/>
        </register>
        <register name="EVCTRL" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="STARTEI" caption="Start Event conversion input enable" mask="0x1"/>
          <bitfield name="STARTINV" caption="Start Conversion Invert" mask="0x8"/>
          <bitfield name="RESRDYEO" caption="Result Ready Event Out" mask="0x10"/>
          <bitfield name="CMPEO" caption="Comparator Window Event Out" mask="0x20"/>
        </register>
      </register-group>
      <register-group name="INT" size="0x10">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="CMPHIT" caption="Compare Hit Disable" mask="0x10"/>
          <bitfield name="SOVFL" caption="Synchonizer Overflow Disable" mask="0x80"/>
          <bitfield name="CHRDYC" caption="Core Current Channel Disable" mask="0x100"/>
          <bitfield name="FLTRDY" caption="Filter Ready Disable" mask="0x200"/>
          <bitfield name="CHNERRC" caption="Channel Overwrite Error Disable" mask="0x400"/>
          <bitfield name="EOSRDY" caption="Endo of Scan Disable" mask="0x800"/>
          <bitfield name="CHRDY" caption="Channel Ready Disable" mask="0xFFFF000"/>
        </register>
