zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_gc01/atdf/PIC32CK1012GC01064.atdf
        <register name="ID_ISAR5" offset="0x74" rw="R" size="4" access-size="4" initval="0x00000000" caption="Instruction Set Attribute Register 5"/>
        <register name="CLIDR" offset="0x78" rw="R" size="4" access-size="4" caption="Cache Level ID Register">
          <bitfield name="Ctype1" caption="Cache type at level 1" mask="0x7" values="CLIDR__Ctype"/>
          <bitfield name="Ctype2" caption="Cache type at level 2" mask="0x38" values="CLIDR__Ctype"/>
          <bitfield name="Ctype3" caption="Cache type at level 3" mask="0x1C0" values="CLIDR__Ctype"/>
          <bitfield name="Ctype4" caption="Cache type at level 4" mask="0xE00" values="CLIDR__Ctype"/>
          <bitfield name="Ctype5" caption="Cache type at level 5" mask="0x7000" values="CLIDR__Ctype"/>
          <bitfield name="Ctype6" caption="Cache type at level 6" mask="0x38000" values="CLIDR__Ctype"/>
          <bitfield name="Ctype7" caption="Cache type at level 7" mask="0x1C0000" values="CLIDR__Ctype"/>
          <bitfield name="LoUIS" caption="Level of Unification Inner Shareable" mask="0xE00000"/>
          <bitfield name="LoC" caption="Level of Coherence" mask="0x7000000"/>
          <bitfield name="LoUU" caption="Level of Unification Uniprocessor" mask="0x38000000"/>
          <bitfield name="ICB" caption="Inner cache boundary" mask="0xC0000000" values="CLIDR__ICB"/>
        </register>
        <register name="CTR" offset="0x7C" rw="R" size="4" access-size="4" caption="Cache Type Register">
          <bitfield name="IminLine" caption="Instruction cache minimum line length" mask="0xF"/>
          <bitfield name="DminLine" caption="Data cache minimum line length" mask="0xF0000"/>
          <bitfield name="ERG" caption="Exclusives Reservation Granule" mask="0xF00000"/>
          <bitfield name="CWG" caption="Cache Write-back Granule" mask="0xF000000"/>
          <bitfield name="Format" caption="Cache Type Register format" mask="0xE0000000" values="CTR__Format"/>
        </register>
        <register name="CCSIDR" offset="0x80" rw="R" size="4" access-size="4" caption="Current Cache Size ID register">
          <bitfield name="LineSize" caption="log2(number of words per line) - 2" mask="0x7"/>
          <bitfield name="Associativity" caption="Associativity - 1" mask="0x1FF8"/>
          <bitfield name="NumSets" caption="Number of sets - 1" mask="0xFFFE000"/>
          <bitfield name="WA" caption="Write-Allocate" mask="0x10000000"/>
          <bitfield name="RA" caption="Read-Allocate" mask="0x20000000"/>
          <bitfield name="WB" caption="Write-Back" mask="0x40000000"/>
          <bitfield name="WT" caption="Write-Through" mask="0x80000000"/>
        </register>
        <register name="CSSELR" offset="0x84" rw="RW" size="4" access-size="4" caption="Cache Size Selection Register">
          <bitfield name="InD" caption="Instruction not Data" mask="0x1"/>
          <bitfield name="Level" caption="Cache level - 1" mask="0xE"/>
        </register>
        <register name="CPACR" offset="0x88" rw="RW" size="4" access-size="4" caption="Coprocessor Access Control Register">
          <bitfield name="CP0" caption="Coprocessor 0 privilege" mask="0x3"/>
          <bitfield name="CP1" caption="Coprocessor 1 privilege" mask="0xC"/>
          <bitfield name="CP2" caption="Coprocessor 2 privilege" mask="0x30"/>
          <bitfield name="CP3" caption="Coprocessor 3 privilege" mask="0xC0"/>
          <bitfield name="CP4" caption="Coprocessor 4 privilege" mask="0x300"/>
          <bitfield name="CP5" caption="Coprocessor 5 privilege" mask="0xC00"/>
          <bitfield name="CP6" caption="Coprocessor 6 privilege" mask="0x3000"/>
          <bitfield name="CP7" caption="Coprocessor 7 privilege" mask="0xC000"/>
          <bitfield name="CP10" caption="Floating-point Extension access rights" mask="0x300000"/>
          <bitfield name="CP11" caption="CP11 Privilege" mask="0xC00000"/>
        </register>
        <register name="NSACR" offset="0x8C" rw="RW" size="4" access-size="4" caption="Non-secure Access Control Register">
          <bitfield name="CP0" caption="Coprocessor 0 Non-secure" mask="0x1"/>
          <bitfield name="CP1" caption="Coprocessor 1 Non-secure" mask="0x2"/>
          <bitfield name="CP2" caption="Coprocessor 2 Non-secure" mask="0x4"/>
          <bitfield name="CP3" caption="Coprocessor 3 Non-secure" mask="0x8"/>
          <bitfield name="CP4" caption="Coprocessor 4 Non-secure" mask="0x10"/>
          <bitfield name="CP5" caption="Coprocessor 5 Non-secure" mask="0x20"/>
          <bitfield name="CP6" caption="Coprocessor 6 Non-secure" mask="0x40"/>
          <bitfield name="CP7" caption="Coprocessor 7 Non-secure" mask="0x80"/>
          <bitfield name="CP10" caption="Floating-point Extension Non-secure" mask="0x400"/>
          <bitfield name="CP11" caption="CP11 Non-secure" mask="0x800"/>
        </register>
      </register-group>
      <value-group name="ICSR__PENDSTCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the SysTick exception" value="1"/>
      </value-group>
      <value-group name="ICSR__PENDSTSET">
        <value name="VALUE_0" caption="Write: no effect; read: SysTick exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes SysTick exception state to pending; read: SysTick exception is pending" value="1"/>
      </value-group>
      <value-group name="ICSR__PENDSVCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the PendSV exception" value="1"/>
      </value-group>
      <value-group name="ICSR__PENDSVSET">
        <value name="VALUE_0" caption="Write: no effect; read: PendSV exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes PendSV exception state to pending; read: PendSV exception is pending" value="1"/>
      </value-group>
      <value-group name="ICSR__PENDNMISET">
        <value name="VALUE_0" caption="Write: no effect; read: NMI exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes NMI exception state to pending; read: NMI exception is pending" value="1"/>
      </value-group>
      <value-group name="AIRCR__VECTCLRACTIVE">
        <value name="NO" caption="Do not clear active state" value="0x0"/>
        <value name="YES" caption="Clear active state" value="0x1"/>
      </value-group>
